namespace Sms.ChinaMobile.Model
{
    public class ChinaMobileStatus
    {
        public static string[] StatusCode =
        {
            "CM:0000",
            "CM:1004",
            "CM:1005",
            "CM:1006",
            "CM:8001",
            "CM:8003",
            "CM:8004",
            "CM:3000",
            "CM:3007",
            "CM:4001",
            "CM:4002",
            "CM:4003",
            "CM:4004",
            "CM:4005",
            "CM:4006",
            "CM:4007",
            "CM:4008",
            "CM:4009",
            "CM:8002",
            "CM:8006",
            "GW:9999"
        };

        public static string[] StatusDesc =
        {
            "Submit成功，消息已经推送至调度层监听队列",
            "签名编号不存在",
            "短信模版编号不存在",
            "短信模版变量参数个数和实际要求不一致",
            "触发全局关键字",
            "触发全局黑名单",
            "触发EC黑名单",
            "真实网关接收消息",
            "业务代码错误，缺少签名编码",
            "无效的接入用户",
            "不允许提交长短信",
            "非法的长短信格式",
            "非法的消息格式",
            "未找到路由",
            "未找到相应的异网签名编码",
            "无效的用户名或密码",
            "报文中携带的手机号超出限制",
            "签名编码与用户信息冲突",
            "发送的短信内容包含研究院敏感词",
            "McAgentTcpSender未启动",
            "请求超时"
        };
    }
}
